vojt444/picoballoon/SW/picoballoon_v1/MCXC242_Project/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_nIRQ_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_nIRQ_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_nIRQ_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_nIRQ_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_nIRQ_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_nIRQ_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_nIRQ_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTE0 (number 1), J3[1]/UART1_TX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SDA_GNSS_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SDA_GNSS_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SDA_GNSS_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTE1 (number 2), J3[3]/UART1_RX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SCL_GNSS_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SCL_GNSS_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SCL_GNSS_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTD7 (number 64), D15-I2C1_SCL/ACCELL_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_TX_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_TX_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_TX_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTD6 (number 63), D14-I2C1_SDA/ACCELL_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RX_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RX_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RX_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTD5 (number 62), J1[11]/J3[2]/SDA_PTD5
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_EXTINT_GNSS_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_EXTINT_GNSS_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_EXTINT_GNSS_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_EXTINT_GNSS_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_EXTINT_GNSS_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EXTINT_GNSS_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EXTINT_GNSS_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTD4 (number 61), J1[9]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_GNSS_EN_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_GNSS_EN_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_GNSS_EN_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_GNSS_EN_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_GNSS_EN_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_GNSS_EN_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_GNSS_EN_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTC10 (number 55), J2[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BELL202_FGPIO FGPIOC              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_BELL202_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BELL202_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_BELL202_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_BELL202_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BELL202_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BELL202_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTE29 (number 17), LED
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DEINIT_LED_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEINIT_LED_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEINIT_LED_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTE29 (number 17), LED
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DEINIT_LED_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEINIT_LED_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEINIT_LED_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                            /* @} */

