vojt444/picoballoon/SW/picoballoon_v1/MCXC242_Project/board/pin_mux.h
/*! @name PORTB1 (number 36), A4-I2C0_SDA/ADC0_SE9
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DEINIT_SDA_SENS_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEINIT_SDA_SENS_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEINIT_SDA_SENS_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORTC3 (number 46), J2[15]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DEINIT_SDN_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEINIT_SDN_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEINIT_SDN_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORTC4 (number 49), D10-SPI0_CS0
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DEINIT_CS_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEINIT_CS_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEINIT_CS_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTC5 (number 50), D13-SPI0_SCK
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DEINIT_SCLK_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEINIT_SCLK_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEINIT_SCLK_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTC6 (number 51), D11-SPI0_MOSI
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DEINIT_MOSI_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEINIT_MOSI_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEINIT_MOSI_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTC7 (number 52), D12-SPI0_MISO
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DEINIT_MISO_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEINIT_MISO_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEINIT_MISO_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTC8 (number 53), D7-TPM0_CH4/CMP0_IN2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DEINIT_nIRQ_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEINIT_nIRQ_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEINIT_nIRQ_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTE0 (number 1), J3[1]/UART1_TX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DEINIT_SDA_GNSS_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEINIT_SDA_GNSS_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEINIT_SDA_GNSS_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORTE1 (number 2), J3[3]/UART1_RX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DEINIT_SCL_GNSS_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEINIT_SCL_GNSS_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEINIT_SCL_GNSS_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORTD7 (number 64), D15-I2C1_SCL/ACCELL_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DEINIT_TX_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEINIT_TX_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEINIT_TX_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTD6 (number 63), D14-I2C1_SDA/ACCELL_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DEINIT_RX_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEINIT_RX_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEINIT_RX_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTD5 (number 62), J1[11]/J3[2]/SDA_PTD5
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DEINIT_EXTINT_GNSS_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEINIT_EXTINT_GNSS_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEINIT_EXTINT_GNSS_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PORTD4 (number 61), J1[9]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DEINIT_GNSS_EN_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEINIT_GNSS_EN_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEINIT_GNSS_EN_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*!
 * @brief This is a de-initialization function for 'BOARD_InitPins' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 */
void BOARD_InitPins_deinit(void);

/*! @name PORTD4 (number 61), J1[9]
  @{ */

